** <2018-07-19 Thu>

DateFormat AM PM 표기시 주의할점 
로케일을 설정하지않으면 ampm이 무시된다. 즉 아래와 같이 쓰는게 best case 

#+BEGIN_SRC swift
  import Foundation
  let timeFormatter:DateFormatter = {
      $0.locale = Locale(identifier: "en_US_POSIX")
      $0.dateFormat = "h:m a"
      $0.amSymbol = "AM"
      $0.pmSymbol = "PM"
      return $0
  }(DateFormatter())

  print(timeFormatter.string(from: Date()))


#+END_SRC

#+RESULTS:
: 9:41 PM


UISegmentedControl 에 Tint color 먹이는방법 
각각의 세그먼트가 subview이므로 subview를 순회하며 ~tintColor~ 를 먹여줘야 적용이 된다.

#+BEGIN_SRC swift
  let segmentedControl = UISegmentedControl()

  // add segment

  for v in segmentedControl.subviews {
      v.tintColor = .orange
  }
#+END_SRC

** <2018-07-13 Fri>

~Int.distance~ ~Int.advanced~ 동작 차이

재미있는건 swift repl 에서는 ~Int.advanced~ 와 ~Int.distance~ 의 동작이 반대다.. 
xcode에서 돌려보면 아래 결과값중 distance 의 값이 8로 리턴된다 -_-a 
#+BEGIN_SRC swift
import Foundation
let distance = -77.distance(to: -85)
let t0 = -77.advanced(by: -85)
print(distance, t0)
#+END_SRC

#+RESULTS:
: 162 8


** <2018-07-09 Mon>

String substring - substring 함수는 NSString 쪽에 있음. common util스러운 함수들은 이전 ~NSFoundation~ class 쪽을 이용하는게 더 낫다.

#+BEGIN_SRC swift
  import Foundation
  let s = ("123456789" as NSString).substring(to: 4)
  print(s)
#+END_SRC

#+RESULTS:
: 1234

String split - join

#+BEGIN_SRC swift
  import Foundation
  let s = "123-456-789".components(separatedBy: "-").joined()
  print(s)
#+END_SRC

#+RESULTS:
: 123456789



*** 완료 collectionview reordering dropsession 이용하지않고 올바른 방법으로 구현
    CLOSED: [2018-06-08 금 11:37]
    :LOGBOOK:
    CLOCK: [2018-06-08 금 10:38]--[2018-06-08 금 11:37] =>  0:59
    :END:
    moveItem 으로 해결 

